In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("Clean-Analyze-and-Present-Data-with-Excel.xlsx")

In [3]:
df.head(5)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,Name,Gender,Department,Age,Date Joined,Salary,Rating
3,NaN,Lindy Guillet,Male,Sales,22,2021-09-07 00:00:00,112780,Above average
4,NaN,Ambros Murthwaite,Male,Procurement,46,2022-07-16 00:00:00,70610,Average